/******************************************************************************

	Copyright (c) 2005, AUTOBOSS Inc. 
	All rights reserved.
		
	文件名称：BaseTroubleCode.cpp
	文档标识：007汽车诊断平台详细设计说明书
	摘    要：故障码读取基类，完成故障码读取及显示

	历史记录：
	----------------------------------------------------------------------------
	时     间   作者		版本号		操    作    内    容                               
	----------------------------------------------------------------------------
	2006.01.11  zhangsh		1.0			创建此类。                                           

******************************************************************************/

#include "BaseTroubleCode.h"

CBaseTroubleCode::CBaseTroubleCode(void)
{
}

inline CBaseTroubleCode::~CBaseTroubleCode(void)
{
}
