/*************************************************************
  Copyright (c) 2006, AUTOBOSS Ltd,.Co 
  All rights reserved.
 
  文件名称：CInformation.h
  文档标识：诊断程序信息类
  摘    要：诊断程序相关信息的保存及取得

  历史记录：
  ----------------------------------------------------------------------------
  时     间   作者   版本号	  操    作    内    容                               
  ----------------------------------------------------------------------------
  2006.1.9    sujer  1.0      创建此类

****************************************************************/

#include "Information.h"

string CInformation::m_strVehicleSystemName = "OBD2";

// 诊断程序版本号
double CInformation::m_fVersion = (double)1.01;

// 设备名，要求诊断程序员设置
string CInformation::m_strEquipmentName = "007";

// 
unsigned short CInformation::m_iVehicleID = 0x0000;

/*-----------------------------------------------------------------------------
  功    能：设置车系名称
  参数说明：char* pVehicleSystemName-指向车系名称字符串的指针
  返 回 值：无
  说    明：无
-----------------------------------------------------------------------------*/
void CInformation::SetVehiclesSystemName(char *pVehicleSystemName)
{
	m_strVehicleSystemName = pVehicleSystemName;
}

/*-----------------------------------------------------------------------------
  功    能：获取车系名称
  参数说明：无
  返 回 值：车系名称字符串
  说    明：无
-----------------------------------------------------------------------------*/
string CInformation::GetVehiclesSystemName()
{
	return m_strVehicleSystemName;
}

/*-----------------------------------------------------------------------------
  功    能：设置版本信息
  参数说明：W_FLOAT fVersion 版本
  返 回 值：无
  说    明：无
-----------------------------------------------------------------------------*/
void CInformation::SetVersion(double fVersion)
{
	m_fVersion = fVersion;
}

/*-----------------------------------------------------------------------------
  功    能：获取版本信息
  参数说明：无
  返 回 值：版本信息
  说    明：无
-----------------------------------------------------------------------------*/
double CInformation::GetVersion()
{
	return m_fVersion;
}

/*-----------------------------------------------------------------------------
  功    能：获取设备名称
  参数说明：无
  返 回 值：设备名称字符串
  说    明：无
-----------------------------------------------------------------------------*/
string CInformation::GetEquipmentName()
{
	return m_strEquipmentName;
}


/*-----------------------------------------------------------------------------
  功    能：获取车系ID
  参数说明：无
  返 回 值：车系ID(2个字节)
  说    明：无
-----------------------------------------------------------------------------*/
unsigned short CInformation::GetVehicleID()
{
	return m_iVehicleID;
}


/*-----------------------------------------------------------------------------
  功    能：设置车系ID
  参数说明：无
  返 回 值：车系ID(2个字节)
  说    明：无
-----------------------------------------------------------------------------*/
void CInformation::SetVehicleID(unsigned short iVehicleID)
{
	m_iVehicleID = iVehicleID;
}